export type WeightListType = {
	[key: string]: string[];
}


export const weightList: WeightListType = {
	"등": [
		"데드리프트",
		"랫 풀 다운",
		"턱걸이",
		"바벨 로우",
		"케이블 로우",
		"바벨 풀오버"
	],
	"가슴": [
		"벤치 프레스",
		"딥스",
		"플라이",
		"팔굽혀펴기",
		"덤벨 풀오버",
	],
	"하체": [
		"스쿼트",
		"런지",
		"레그 프레스",
		"레그 익스텐션",
		"레그 컬",
		"데드리프트",
		"스티프 레그 데드리프트",
		"카프 레이즈",
	],
	"어깨": [
		"숄더 프레스",
		"사이드 레터럴 레이즈",
		"프론트 레터럴 레이즈",
		"벤트 오버 레터럴 레이즈",
		"업라이트 로우",
	],
	"팔": [
		"바벨 컬",
		"덤벨 컬",
		"해머 컬",
		"트라이셉스 익스텐션",
		"덤벨 킥백",
		"케이블 푸시 다운",
		"케이블 컬",
	],
	"복근": [
		"크런치",
		"레그 레이즈",
		"플랭크",
		"사이드 플랭크",
		"힙 레이즈",
		"힙 쓰러스트",
	],
	"유산소": [
		"런닝머신",
		"싸이클",
		"로잉머신",
		"스텝퍼",
		"에어로빅",
		"스피닝",
		"줄넘기",
		"수영",
		"등산",
		"자전거",
		"스쿼시",
		"테니스",
		"배드민턴",
		"농구",
		"축구",
		"야구",
		"탁구",
	]
};